Revit 2027 API
WallLocationLine Enumeration
 This enumerated type represents the options for alignment of a wall's location line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WallLocationLine
Public Enumeration WallLocationLine
public enum class WallLocationLine
type WallLocationLine
Members
Member name | Value | Description
CoreCenterline | 1 |  The wall location line is aligned to the center of the core.
CoreExterior | 4 |  The wall location line is aligned to the exterior face of the core.
CoreInterior | 5 |  The wall location line is aligned to the exterior face of the core.
FinishFaceExterior | 2 |  The wall location line is aligned to the exterior face of the wall.
FinishFaceInterior | 3 |  The wall location line is aligned to the interior face of the wall.
WallCenterline | 0 |  The wall location line is aligned to the center of the wall.
See Also
Reference
Autodesk.Revit.DB Namespace